g4klx/MMDVM/STM32F7XX_Lib/Device/startup/startup_stm32f7xx.c
/**
  ******************************************************************************
  * @file      startup_stm32f4xx.s
  * @author    Coocox
  * @version   V1.0
  * @date      03/05/2012
  * @brief     STM32F4xx Devices vector table for RIDE7 toolchain. 
  *            This module performs:
  *                - Set the initial SP
  *                - Set the initial PC == Reset_Handler,
  *                - Set the vector table entries with the exceptions ISR address
  *                - Configure the clock system and the external SRAM mounted on 
  *                  STM324xG-EVAL board to be used as data memory (optional, 
  *                  to be enabled by user)
  *                - Branches to main in the C library (which eventually
  *                  calls main()).
  *            After Reset the Cortex-M4 processor is in Thread mode,
  *            priority is Privileged, and the Stack is set to Main.
  ******************************************************************************
  */
  
/* Some modifications by Andy Uribe CA6JAU :
- Added C++ global constructors support
- Changed initial stack pointer
- Changed support for STM32F767
*/

/*----------Macro definition--------------------------------------------------*/
#define WEAK __attribute__ ((weak))

/*----------Declaration of the default fault handlers-------------------------*/
/* System exception vector handler */
__attribute__ ((used))
void WEAK  Reset_Handler(void);

void WEAK  NMI_Handler(void);
void WEAK  HardFault_Handler(void);
void WEAK  MemManage_Handler(void);
void WEAK  BusFault_Handler(void);
void WEAK  UsageFault_Handler(void);
void WEAK  SVC_Handler(void);
void WEAK  DebugMon_Handler(void);
void WEAK  PendSV_Handler(void);
void WEAK  SysTick_Handler(void);
  
  /* External Interrupts */
void WEAK  WWDG_IRQHandler(void);                   /* Window WatchDog              */
void WEAK  PVD_IRQHandler(void);                    /* PVD through EXTI Line detection */
void WEAK  TAMP_STAMP_IRQHandler(void);             /* Tamper and TimeStamps through the EXTI line */
void WEAK  RTC_WKUP_IRQHandler(void);               /* RTC Wakeup through the EXTI line */
void WEAK  FLASH_IRQHandler(void);                  /* FLASH                        */
void WEAK  RCC_IRQHandler(void);                    /* RCC                          */
void WEAK  EXTI0_IRQHandler(void);                  /* EXTI Line0                   */
void WEAK  EXTI1_IRQHandler(void);                  /* EXTI Line1                   */
void WEAK  EXTI2_IRQHandler(void);                  /* EXTI Line2                   */
void WEAK  EXTI3_IRQHandler(void);                  /* EXTI Line3                   */
void WEAK  EXTI4_IRQHandler(void);                  /* EXTI Line4                   */
void WEAK  DMA1_Stream0_IRQHandler(void);           /* DMA1 Stream 0                */
void WEAK  DMA1_Stream1_IRQHandler(void);           /* DMA1 Stream 1                */
void WEAK  DMA1_Stream2_IRQHandler(void);           /* DMA1 Stream 2                */
void WEAK  DMA1_Stream3_IRQHandler(void);           /* DMA1 Stream 3                */
void WEAK  DMA1_Stream4_IRQHandler(void);           /* DMA1 Stream 4                */
void WEAK  DMA1_Stream5_IRQHandler(void);           /* DMA1 Stream 5                */
void WEAK  DMA1_Stream6_IRQHandler(void);           /* DMA1 Stream 6                */
void WEAK  ADC_IRQHandler(void);                    /* ADC1, ADC2 and ADC3s         */
void WEAK  CAN1_TX_IRQHandler(void);                /* CAN1 TX                      */
void WEAK  CAN1_RX0_IRQHandler(void);               /* CAN1 RX0                     */
void WEAK  CAN1_RX1_IRQHandler(void);               /* CAN1 RX1                     */
void WEAK  CAN1_SCE_IRQHandler(void);               /* CAN1 SCE                     */
void WEAK  EXTI9_5_IRQHandler(void);                /* External Line[9:5]s          */
void WEAK  TIM1_BRK_TIM9_IRQHandler(void);          /* TIM1 Break and TIM9          */
void WEAK  TIM1_UP_TIM10_IRQHandler(void);          /* TIM1 Update and TIM10        */
void WEAK  TIM1_TRG_COM_TIM11_IRQHandler(void);     /* TIM1 Trigger and Commutation and TIM11 */
void WEAK  TIM1_CC_IRQHandler(void);                /* TIM1 Capture Compare         */
void WEAK  TIM2_IRQHandler(void);                   /* TIM2                         */
void WEAK  TIM3_IRQHandler(void);                   /* TIM3                         */
void WEAK  TIM4_IRQHandler(void);                   /* TIM4                         */
void WEAK  I2C1_EV_IRQHandler(void);                /* I2C1 Event                   */
void WEAK  I2C1_ER_IRQHandler(void);                /* I2C1 Error                   */
void WEAK  I2C2_EV_IRQHandler(void);                /* I2C2 Event                   */
void WEAK  I2C2_ER_IRQHandler(void);                /* I2C2 Error                   */
void WEAK  SPI1_IRQHandler(void);                   /* SPI1                         */
void WEAK  SPI2_IRQHandler(void);                   /* SPI2                         */
void WEAK  USART1_IRQHandler(void);                 /* USART1                       */
void WEAK  USART2_IRQHandler(void);                 /* USART2                       */
void WEAK  USART3_IRQHandler(void);                 /* USART3                       */
void WEAK  EXTI15_10_IRQHandler(void);              /* External Line[15:10]s        */
void WEAK  RTC_Alarm_IRQHandler(void);              /* RTC Alarm (A and B) through EXTI Line */
void WEAK  OTG_FS_WKUP_IRQHandler(void);            /* USB OTG FS Wakeup through EXTI line */
void WEAK  TIM8_BRK_TIM12_IRQHandler(void);         /* TIM8 Break and TIM12         */
void WEAK  TIM8_UP_TIM13_IRQHandler(void);          /* TIM8 Update and TIM13        */
void WEAK  TIM8_TRG_COM_TIM14_IRQHandler(void);     /* TIM8 Trigger and Commutation and TIM14 */
void WEAK  TIM8_CC_IRQHandler(void);                /* TIM8 Capture Compare         */
void WEAK  DMA1_Stream7_IRQHandler(void);           /* DMA1 Stream7                 */
void WEAK  FMC_IRQHandler(void);                    /* FMC                          */
void WEAK  SDMMC1_IRQHandler(void);                 /* SDMMC1                       */
void WEAK  TIM5_IRQHandler(void);                   /* TIM5                         */
void WEAK  SPI3_IRQHandler(void);                   /* SPI3                         */
void WEAK  UART4_IRQHandler(void);                  /* UART4                        */
void WEAK  UART5_IRQHandler(void);                  /* UART5                        */
void WEAK  TIM6_DAC_IRQHandler(void);               /* TIM6 and DAC1&2 underrun errors */
void WEAK  TIM7_IRQHandler(void);                   /* TIM7                         */
void WEAK  DMA2_Stream0_IRQHandler(void);           /* DMA2 Stream 0                */
void WEAK  DMA2_Stream1_IRQHandler(void);           /* DMA2 Stream 1                */
void WEAK  DMA2_Stream2_IRQHandler(void);           /* DMA2 Stream 2                */
void WEAK  DMA2_Stream3_IRQHandler(void);           /* DMA2 Stream 3                */
void WEAK  DMA2_Stream4_IRQHandler(void);           /* DMA2 Stream 4                */
void WEAK  ETH_IRQHandler(void);                    /* Ethernet                     */
void WEAK  ETH_WKUP_IRQHandler(void);               /* Ethernet Wakeup through EXTI line */
void WEAK  CAN2_TX_IRQHandler(void);                /* CAN2 TX                      */
void WEAK  CAN2_RX0_IRQHandler(void);               /* CAN2 RX0                     */
void WEAK  CAN2_RX1_IRQHandler(void);               /* CAN2 RX1                     */
void WEAK  CAN2_SCE_IRQHandler(void);               /* CAN2 SCE                     */
void WEAK  OTG_FS_IRQHandler(void);                 /* USB OTG FS                   */
void WEAK  DMA2_Stream5_IRQHandler(void);           /* DMA2 Stream 5                */
void WEAK  DMA2_Stream6_IRQHandler(void);           /* DMA2 Stream 6                */
void WEAK  DMA2_Stream7_IRQHandler(void);           /* DMA2 Stream 7                */
void WEAK  USART6_IRQHandler(void);                 /* USART6                       */
void WEAK  I2C3_EV_IRQHandler(void);                /* I2C3 event                   */
void WEAK  I2C3_ER_IRQHandler(void);                /* I2C3 error                   */
void WEAK  OTG_HS_EP1_OUT_IRQHandler(void);         /* USB OTG HS End Point 1 Out   */
void WEAK  OTG_HS_EP1_IN_IRQHandler(void);          /* USB OTG HS End Point 1 In    */
void WEAK  OTG_HS_WKUP_IRQHandler(void);            /* USB OTG HS Wakeup through EXTI */
void WEAK  OTG_HS_IRQHandler(void);                 /* USB OTG HS                   */
void WEAK  DCMI_IRQHandler(void);                   /* DCMI                         */
void WEAK  RNG_IRQHandler(void);                    /* RNG                          */
void WEAK  FPU_IRQHandler(void);                    /* FPU                          */
void WEAK  UART7_IRQHandler(void);                  /* UART7                        */
void WEAK  UART8_IRQHandler(void);                  /* UART8                        */
void WEAK  SPI4_IRQHandler(void);                   /* SPI4                         */
void WEAK  SPI5_IRQHandler(void);                   /* SPI5                         */
void WEAK  SPI6_IRQHandler(void);                   /* SPI6                         */
void WEAK  SAI1_IRQHandler(void);                   /* SAI1                         */
void WEAK  LTDC_IRQHandler(void);                   /* LTDC                         */
void WEAK  LTDC_ER_IRQHandler(void);                /* LTDC error                   */
void WEAK  DMA2D_IRQHandler(void);                  /* DMA2D                        */
void WEAK  SAI2_IRQHandler(void);                   /* SAI2                         */
void WEAK  QUADSPI_IRQHandler(void);                /* QUADSPI                      */
void WEAK  LPTIM1_IRQHandler(void);                 /* LPTIM1                       */
void WEAK  CEC_IRQHandler(void);                    /* HDMI_CEC                     */
void WEAK  I2C4_EV_IRQHandler(void);                /* I2C4 Event                   */
void WEAK  I2C4_ER_IRQHandler(void);                /* I2C4 Error                   */
void WEAK  SPDIF_RX_IRQHandler(void);               /* SPDIF_RX                     */
void WEAK  DFSDM1_FLT0_IRQHandler(void);            /* DFSDM1 Filter 0 global Interrupt */
void WEAK  DFSDM1_FLT1_IRQHandler(void);            /* DFSDM1 Filter 1 global Interrupt */
void WEAK  DFSDM1_FLT2_IRQHandler(void);            /* DFSDM1 Filter 2 global Interrupt */
void WEAK  DFSDM1_FLT3_IRQHandler(void);            /* DFSDM1 Filter 3 global Interrupt */
void WEAK  SDMMC2_IRQHandler(void);                 /* SDMMC2                       */
void WEAK  CAN3_TX_IRQHandler(void);                /* CAN3 TX                      */
void WEAK  CAN3_RX0_IRQHandler(void);               /* CAN3 RX0                     */
void WEAK  CAN3_RX1_IRQHandler(void);               /* CAN3 RX1                     */
void WEAK  CAN3_SCE_IRQHandler(void);               /* CAN3 SCE                     */
void WEAK  JPEG_IRQHandler(void);                   /* JPEG                         */
void WEAK  MDIOS_IRQHandler(void);                  /* MDIOS                        */
  
/*----------Symbols defined in linker script----------------------------------*/
extern unsigned long _estack;    /*!< The initial stack pointer               */
extern unsigned long _sidata;    /*!< Start address for the initialization
                                      values of the .data section.            */
extern unsigned long _sdata;     /*!< Start address for the .data section     */
extern unsigned long _edata;     /*!< End address for the .data section       */
extern unsigned long _sbss;      /*!< Start address for the .bss section      */
extern unsigned long _ebss;      /*!< End address for the .bss section        */

/* C++ global constructors support */
extern unsigned long __preinit_array_start;
extern unsigned long __preinit_array_end;
extern unsigned long __init_array_start;
extern unsigned long __init_array_end;

