g4klx/MMDVM/STM32F7XX_Lib/Device/startup/startup_stm32f7xx.c
  //Call C++ global constructors
  call_constructors(&__preinit_array_start, &__preinit_array_end);
  call_constructors(&__init_array_start, &__init_array_end);

  /* Call the application's entry point.*/
  main();
}


/**
  *@brief Provide weak aliases for each Exception handler to the Default_Handler.
  *       As they are weak aliases, any function with the same name will override
  *       this definition.
  */
#pragma weak Reset_Handler = Default_Reset_Handler
#pragma weak NMI_Handler = Default_Reset_Handler
#pragma weak HardFault_Handler = Default_Reset_Handler
#pragma weak MemManage_Handler = Default_Reset_Handler
#pragma weak BusFault_Handler = Default_Reset_Handler
#pragma weak UsageFault_Handler = Default_Reset_Handler
#pragma weak SVC_Handler = Default_Reset_Handler
#pragma weak DebugMon_Handler = Default_Reset_Handler
#pragma weak PendSV_Handler = Default_Reset_Handler
#pragma weak SysTick_Handler = Default_Reset_Handler
  
  /* External Interrupts */
#pragma weak WWDG_IRQHandler = Default_Reset_Handler                   /* Window WatchDog              */
#pragma weak PVD_IRQHandler = Default_Reset_Handler                    /* PVD through EXTI Line detection */
#pragma weak TAMP_STAMP_IRQHandler = Default_Reset_Handler             /* Tamper and TimeStamps through the EXTI line */
#pragma weak RTC_WKUP_IRQHandler = Default_Reset_Handler               /* RTC Wakeup through the EXTI line */
#pragma weak FLASH_IRQHandler = Default_Reset_Handler                  /* FLASH                        */
#pragma weak RCC_IRQHandler = Default_Reset_Handler                    /* RCC                          */
#pragma weak EXTI0_IRQHandler = Default_Reset_Handler                  /* EXTI Line0                   */
#pragma weak EXTI1_IRQHandler = Default_Reset_Handler                  /* EXTI Line1                   */
#pragma weak EXTI2_IRQHandler = Default_Reset_Handler                  /* EXTI Line2                   */
#pragma weak EXTI3_IRQHandler = Default_Reset_Handler                  /* EXTI Line3                   */
#pragma weak EXTI4_IRQHandler = Default_Reset_Handler                  /* EXTI Line4                   */
#pragma weak DMA1_Stream0_IRQHandler = Default_Reset_Handler           /* DMA1 Stream 0                */
#pragma weak DMA1_Stream1_IRQHandler = Default_Reset_Handler           /* DMA1 Stream 1                */
#pragma weak DMA1_Stream2_IRQHandler = Default_Reset_Handler           /* DMA1 Stream 2                */
#pragma weak DMA1_Stream3_IRQHandler = Default_Reset_Handler           /* DMA1 Stream 3                */
#pragma weak DMA1_Stream4_IRQHandler = Default_Reset_Handler           /* DMA1 Stream 4                */
#pragma weak DMA1_Stream5_IRQHandler = Default_Reset_Handler           /* DMA1 Stream 5                */
#pragma weak DMA1_Stream6_IRQHandler = Default_Reset_Handler           /* DMA1 Stream 6                */
#pragma weak ADC_IRQHandler = Default_Reset_Handler                    /* ADC1, ADC2 and ADC3s         */
#pragma weak CAN1_TX_IRQHandler = Default_Reset_Handler                /* CAN1 TX                      */
#pragma weak CAN1_RX0_IRQHandler = Default_Reset_Handler               /* CAN1 RX0                     */
#pragma weak CAN1_RX1_IRQHandler = Default_Reset_Handler               /* CAN1 RX1                     */
#pragma weak CAN1_SCE_IRQHandler = Default_Reset_Handler               /* CAN1 SCE                     */
#pragma weak EXTI9_5_IRQHandler = Default_Reset_Handler                /* External Line[9:5]s          */
#pragma weak TIM1_BRK_TIM9_IRQHandler = Default_Reset_Handler          /* TIM1 Break and TIM9          */
#pragma weak TIM1_UP_TIM10_IRQHandler = Default_Reset_Handler          /* TIM1 Update and TIM10        */
#pragma weak TIM1_TRG_COM_TIM11_IRQHandler = Default_Reset_Handler     /* TIM1 Trigger and Commutation and TIM11 */
#pragma weak TIM1_CC_IRQHandler = Default_Reset_Handler                /* TIM1 Capture Compare         */
#pragma weak TIM2_IRQHandler = Default_Reset_Handler                   /* TIM2                         */
#pragma weak TIM3_IRQHandler = Default_Reset_Handler                   /* TIM3                         */
#pragma weak TIM4_IRQHandler = Default_Reset_Handler                   /* TIM4                         */
#pragma weak I2C1_EV_IRQHandler = Default_Reset_Handler                /* I2C1 Event                   */
#pragma weak I2C1_ER_IRQHandler = Default_Reset_Handler                /* I2C1 Error                   */
#pragma weak I2C2_EV_IRQHandler = Default_Reset_Handler                /* I2C2 Event                   */
#pragma weak I2C2_ER_IRQHandler = Default_Reset_Handler                /* I2C2 Error                   */
#pragma weak SPI1_IRQHandler = Default_Reset_Handler                   /* SPI1                         */
#pragma weak SPI2_IRQHandler = Default_Reset_Handler                   /* SPI2                         */
#pragma weak USART1_IRQHandler = Default_Reset_Handler                 /* USART1                       */
#pragma weak USART2_IRQHandler = Default_Reset_Handler                 /* USART2                       */
#pragma weak USART3_IRQHandler = Default_Reset_Handler                 /* USART3                       */
#pragma weak EXTI15_10_IRQHandler = Default_Reset_Handler              /* External Line[15:10]s        */
#pragma weak RTC_Alarm_IRQHandler = Default_Reset_Handler              /* RTC Alarm (A and B) through EXTI Line */
#pragma weak OTG_FS_WKUP_IRQHandler = Default_Reset_Handler            /* USB OTG FS Wakeup through EXTI line */
#pragma weak TIM8_BRK_TIM12_IRQHandler = Default_Reset_Handler         /* TIM8 Break and TIM12         */
#pragma weak TIM8_UP_TIM13_IRQHandler = Default_Reset_Handler          /* TIM8 Update and TIM13        */
#pragma weak TIM8_TRG_COM_TIM14_IRQHandler = Default_Reset_Handler     /* TIM8 Trigger and Commutation and TIM14 */
#pragma weak TIM8_CC_IRQHandler = Default_Reset_Handler                /* TIM8 Capture Compare         */
#pragma weak DMA1_Stream7_IRQHandler = Default_Reset_Handler           /* DMA1 Stream7                 */
#pragma weak FMC_IRQHandler = Default_Reset_Handler                    /* FMC                          */
#pragma weak SDMMC1_IRQHandler = Default_Reset_Handler                 /* SDMMC1                       */
#pragma weak TIM5_IRQHandler = Default_Reset_Handler                   /* TIM5                         */
#pragma weak SPI3_IRQHandler = Default_Reset_Handler                   /* SPI3                         */
#pragma weak UART4_IRQHandler = Default_Reset_Handler                  /* UART4                        */
#pragma weak UART5_IRQHandler = Default_Reset_Handler                  /* UART5                        */
#pragma weak TIM6_DAC_IRQHandler = Default_Reset_Handler               /* TIM6 and DAC1&2 underrun errors */
#pragma weak TIM7_IRQHandler = Default_Reset_Handler                   /* TIM7                         */
#pragma weak DMA2_Stream0_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 0                */
#pragma weak DMA2_Stream1_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 1                */
#pragma weak DMA2_Stream2_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 2                */
#pragma weak DMA2_Stream3_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 3                */
#pragma weak DMA2_Stream4_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 4                */
#pragma weak ETH_IRQHandler = Default_Reset_Handler                    /* Ethernet                     */
#pragma weak ETH_WKUP_IRQHandler = Default_Reset_Handler               /* Ethernet Wakeup through EXTI line */
#pragma weak CAN2_TX_IRQHandler = Default_Reset_Handler                /* CAN2 TX                      */
#pragma weak CAN2_RX0_IRQHandler = Default_Reset_Handler               /* CAN2 RX0                     */
#pragma weak CAN2_RX1_IRQHandler = Default_Reset_Handler               /* CAN2 RX1                     */
#pragma weak CAN2_SCE_IRQHandler = Default_Reset_Handler               /* CAN2 SCE                     */
#pragma weak OTG_FS_IRQHandler = Default_Reset_Handler                 /* USB OTG FS                   */
#pragma weak DMA2_Stream5_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 5                */
#pragma weak DMA2_Stream6_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 6                */
#pragma weak DMA2_Stream7_IRQHandler = Default_Reset_Handler           /* DMA2 Stream 7                */
#pragma weak USART6_IRQHandler = Default_Reset_Handler                 /* USART6                       */
#pragma weak I2C3_EV_IRQHandler = Default_Reset_Handler                /* I2C3 event                   */
#pragma weak I2C3_ER_IRQHandler = Default_Reset_Handler                /* I2C3 error                   */
#pragma weak OTG_HS_EP1_OUT_IRQHandler = Default_Reset_Handler         /* USB OTG HS End Point 1 Out   */
#pragma weak OTG_HS_EP1_IN_IRQHandler = Default_Reset_Handler          /* USB OTG HS End Point 1 In    */
#pragma weak OTG_HS_WKUP_IRQHandler = Default_Reset_Handler            /* USB OTG HS Wakeup through EXTI */
#pragma weak OTG_HS_IRQHandler = Default_Reset_Handler                 /* USB OTG HS                   */
#pragma weak DCMI_IRQHandler = Default_Reset_Handler                   /* DCMI                         */
#pragma weak RNG_IRQHandler = Default_Reset_Handler                    /* RNG                          */
#pragma weak FPU_IRQHandler = Default_Reset_Handler                    /* FPU                          */
#pragma weak UART7_IRQHandler = Default_Reset_Handler                  /* UART7                        */
#pragma weak UART8_IRQHandler = Default_Reset_Handler                  /* UART8                        */
#pragma weak SPI4_IRQHandler = Default_Reset_Handler                   /* SPI4                         */
#pragma weak SPI5_IRQHandler = Default_Reset_Handler                   /* SPI5                         */
#pragma weak SPI6_IRQHandler = Default_Reset_Handler                   /* SPI6                         */
#pragma weak SAI1_IRQHandler = Default_Reset_Handler                   /* SAI1                         */
#pragma weak LTDC_IRQHandler = Default_Reset_Handler                   /* LTDC                         */
#pragma weak LTDC_ER_IRQHandler = Default_Reset_Handler                /* LTDC error                   */
#pragma weak DMA2D_IRQHandler = Default_Reset_Handler                  /* DMA2D                        */
#pragma weak SAI2_IRQHandler = Default_Reset_Handler                   /* SAI2                         */
#pragma weak QUADSPI_IRQHandler = Default_Reset_Handler                /* QUADSPI                      */
#pragma weak LPTIM1_IRQHandler = Default_Reset_Handler                 /* LPTIM1                       */
#pragma weak CEC_IRQHandler = Default_Reset_Handler                    /* HDMI_CEC                     */
#pragma weak I2C4_EV_IRQHandler = Default_Reset_Handler                /* I2C4 Event                   */
#pragma weak I2C4_ER_IRQHandler = Default_Reset_Handler                /* I2C4 Error                   */
#pragma weak SPDIF_RX_IRQHandler = Default_Reset_Handler               /* SPDIF_RX                     */
#pragma weak DFSDM1_FLT0_IRQHandler = Default_Reset_Handler            /* DFSDM1 Filter 0 global Interrupt */
#pragma weak DFSDM1_FLT1_IRQHandler = Default_Reset_Handler            /* DFSDM1 Filter 1 global Interrupt */
#pragma weak DFSDM1_FLT2_IRQHandler = Default_Reset_Handler            /* DFSDM1 Filter 2 global Interrupt */
#pragma weak DFSDM1_FLT3_IRQHandler = Default_Reset_Handler            /* DFSDM1 Filter 3 global Interrupt */
#pragma weak SDMMC2_IRQHandler = Default_Reset_Handler                 /* SDMMC2                       */
#pragma weak CAN3_TX_IRQHandler = Default_Reset_Handler                /* CAN3 TX                      */
#pragma weak CAN3_RX0_IRQHandler = Default_Reset_Handler               /* CAN3 RX0                     */
#pragma weak CAN3_RX1_IRQHandler = Default_Reset_Handler               /* CAN3 RX1                     */
#pragma weak CAN3_SCE_IRQHandler = Default_Reset_Handler               /* CAN3 SCE                     */
#pragma weak JPEG_IRQHandler = Default_Reset_Handler                   /* JPEG                         */
#pragma weak MDIOS_IRQHandler = Default_Reset_Handler                  /* MDIOS                        */

/**
  * @brief  This is the code that gets called when the processor receives an
  *         unexpected interrupt.  This simply enters an infinite loop,
  *         preserving the system state for examination by a debugger.
  * @param  None
  * @retval None
  */
static void Default_Handler(void)
{
  /* Go into an infinite loop. */
  while (1)
  {
  }
}

/*********************** (C) COPYRIGHT 2009 Coocox ************END OF FILE*****/
